cask_args appdir: "/Applications"

brew "git"
brew "nkf"
brew "wget"
brew "jq"

brew "cowsay"
brew "ffmpeg"

cask "alfred"
cask "docker"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "visual-studio-code"
cask "iterm2"
cask "macpass"
cask "scroll-reverser"

mas "GIPHY CAPTURE", id: 668208984
mas "RunCat", id: 1429033973
