cask_args appdir: "/Applications"

brew "git"
brew "wget"
brew "jq"
brew "cowsay"

cask "alfred"
cask "google-chrome"
cask "google-japanese-ime"
cask "scroll-reverser"
cask "shiftit"
cask "karabiner-elements"
cask "clipy"
cask "macpass"

# cask "docker"
cask "iterm2"

cask "onedrive"

# cask "macdown"
# cask "intellij-idea-ce"
cask "visual-studio-code"
cask "sublime-text"
cask "boostnote"
cask "typora"
cask "postman"

mas "Parallels Client", id: 600925318
mas "GIPHY CAPTURE", id: 668208984
mas "RunCat", id: 1429033973

# brew "gradle"
# nkf
# brew "asdf"
# brew "cntlm"
# brew "gnupg"
# brew "flyway"
# brew "ffmpeg"

# cask "slack"

# mas "Fantastical", id: 975937182
# mas "Todoist", id: 585829637
# mas "WinArchiver Lite", id: 414855915
# mas "iMage Tools", id: 493949693
