###
# ・Brewfileのアプリをインストール
# brew bundle
# ・Brewfile以外でインストールしたアプリを削除
# brew bundle cleanup
# ・インストール済みリストファイルを作成
# brew bundle dump --file Brewfile_`date "+%Y%m%d"`
# --
# ・Homebrewを更新
# brew update
# ・インストール済みアプリを更新
# brew upgrade
# ・update, upgradeでの作業領域を削除
# brew cleanup
###

cask_args appdir: "/Applications"

brew "git"
cask "github"
brew "wget"
brew "jq"
brew "cowsay"
brew "nkf"

# launguage
## Java
brew "jenv"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
# brew "temurin"
# brew "openjdk@8"
cask "adoptopenjdk8"
brew "ant"
brew "gradle"

## Python
brew "pyenv"
cask "anaconda"

## Go
brew "go"
brew "golang-migrate"

## Plantuml
brew "graphviz"
# java
brew "plantuml"

# cask "alfred"
cask "raycast"
# cask "google-chrome"
cask "google-japanese-ime"
cask "scroll-reverser"
# cask "shiftit"
cask "rectangle"
cask "karabiner-elements"
cask "elgato-stream-deck"
cask "krisp"
# cask "logitech-options"
cask "logi-options-plus"

cask "iterm2"

cask "docker"
brew "awscli"
brew "aws-vault"
brew "tfenv"
cask "session-manager-plugin"

cask "cyberduck"

## IDE/TextEditor
cask "android-studio"
cask "android-file-transfer"
cask "intellij-idea-ce"
cask "visual-studio-code"
cask "sublime-text"
cask "typora"

cask "dbeaver-community"
cask "pgadmin4"
cask "clipy"

cask "macpass"

# mas "Parallels Client", id: 600925318
cask "betterdummy"

mas "GIPHY CAPTURE", id: 668208984
mas "RunCat", id: 1429033973
mas "Amphetamine", id: 937984704

# brew "asdf"
# brew "cntlm"
# brew "gnupg"
# brew "flyway"
# brew "ffmpeg"
# cask "slack"
# brew "mjml"
# brew "lima"
# cask "background-music"

mas "Fantastical", id: 975937182
mas "Todoist", id: 585829637

# mas "The Unarchiver", id: 425424353

# UHK Agent: https://ultimatehackingkeyboard.com/agent
# HHKB Keymap Tool: https://happyhackingkb.com/jp/download/
